
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции 

Процедура ОтправитьСообщенияВТелеграммРегламентно() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомленияТелеграмБоту.Ссылка,
	|	УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК УведомленияТелеграмБоту
	|ГДЕ
	|	УведомленияТелеграмБоту.ПометкаУдаления = ЛОЖЬ";

	Выборка = Запрос.Выполнить().Выбрать();
	
	ТокенУправленияТелеграмБотом = ПолучитьЗначениеКонстанты("ВКМ_ТокенУправленияТелеграмБотом");
	ИдентификаторГруппыДляОповещения = ПолучитьЗначениеКонстанты("ВКМ_ИдентификаторГруппыДляОповещения");   
	Сообщить(ИдентификаторГруппыДляОповещения);
	Сообщить(ТокенУправленияТелеграмБотом);
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = Выборка.ТекстСообщения;
		ОтправитьСообщениеВТелеграмм(ТекстСообщения, ТокенУправленияТелеграмБотом, ИдентификаторГруппыДляОповещения);
		Выборка.Ссылка.ПолучитьОбъект().Удалить();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
		
	Возврат Константы[ИмяКонстанты].Получить();

КонецФункции

Процедура ОтправитьСообщениеВТелеграмм(ТекстСообщения, ТокенУправленияТелеграмБотом, ИдентификаторГруппыДляОповещения) Экспорт
	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);  
	ДанныеДляОтправки = Новый структура;
	ДанныеДляОтправки.Вставить("chat_id", ИдентификаторГруппыДляОповещения);
	ДанныеДляОтправки.Вставить("text", ТекстСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	Токен = ТокенУправленияТелеграмБотом;
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтправки);
	Строказапроса = ЗаписьJSON.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	Запрос = Новый HTTPЗапрос("bot" + Токен + "/sendMessage", Заголовки);
	Запрос.УстановитьТелоИзСтроки(Строказапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Если Ответ.КодСостояния <> 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации(ТелоОтвета, УровеньЖурналаРегистрации.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
