
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресВХ = Параметры.АдресВХ;

	ТЗСотрудники = ПолучитьИзВременногоХранилища(АдресВХ);

	ПодготвитьДиаграммГанта(ДиаграммаГанта);
	ЗаполнитьГрафикОтпусков(ДиаграммаГанта, ТЗСотрудники);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПодготвитьДиаграммГанта(ДиаграммаГанта)
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьГрафикОтпусков(ДиаграммаГанта, ТЗСотрудники)

	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");

	Для Каждого Строка Из ТЗСотрудники Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти