

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//<<KoshAU Управление видимостью реквизитов договора абонентской платы	
	Элементы.ГруппаАбонентсокеОбслуживание.Видимость = Ложь; 
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаАбонентсокеОбслуживание.Видимость = Истина;
	КонецЕсли;	
	//>>
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

 &НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//<<KoshAU Управление видимостью реквизитов договора абонентской платы	
	Элементы.ГруппаАбонентсокеОбслуживание.Видимость = Ложь; 
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаАбонентсокеОбслуживание.Видимость = Истина;
	КонецЕсли;	
	//>>
КонецПроцедуры

#КонецОбласти