
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ПериодРегистрации = '00010101' Тогда
		ТекстСообщения = "Укажите период регистрации";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПериодРегистрации", "Объект");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьПоОстаткамРегистраВзаиморасчетов();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
КонецПроцедуры

#КонецОбласти
